*** consonance/vmm-core/src/snapshot.rs:527:48: replace != with == in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace != with == in unrepresentable_state
@@ -519,17 +519,17 @@
              is 64-bit / paging-off, where PDPTRs are unused)",
         );
     }
     let e = &vcpu.events;
     // Every `VcpuEvents` field NOT in the captured subset {exception_pending,
     // exception_nr, exception_error_code, nmi_pending, smi_pending, interrupt_shadow}
     // — EXCLUDING the validity-mask `flags`. Any non-zero value is in-flight
     // injection / SMM / triple-fault state the restore would silently drop.
-    let dropped_nonzero = e.exception_injected != 0
+    let dropped_nonzero = e.exception_injected == /* ~ changed by cargo-mutants ~ */ 0
         || e.exception_has_error_code != 0
         || e.exception_has_payload != 0
         || e.exception_payload != 0
         || e.interrupt_injected != 0
         || e.interrupt_nr != 0
         || e.interrupt_soft != 0
         || e.nmi_injected != 0
         || e.nmi_masked != 0


  stderr ───
    [vmm-core] msr-exit dir=WRMSR exit-reason=KVM_EXIT_X86_WRMSR index=0x3b data=0x1234 rip=0x0 work=500 disposition=EmulateVtime

    thread 'vmm::tests::branch_restores_then_forks_the_entropy_stream' (58568931) panicked at consonance/vmm-core/src/vmm.rs:4332:35:
    called `Result::unwrap()` on an `Err` value: ContractViolation("save_vm_state: pending-event state outside the captured subset is set (in-flight injection / SMM / triple-fault) — snapshot only at a quiescent point (nothing armed)")
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.027s] (126/224) vmm-core vmm::tests::branch_restores_then_forks_the_entropy_stream

*** result: Failure(100)
