*** consonance/vmm-core/src/snapshot.rs:532:9: replace || with && in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace || with && in unrepresentable_state
@@ -524,17 +524,17 @@
     // exception_nr, exception_error_code, nmi_pending, smi_pending, interrupt_shadow}
     // — EXCLUDING the validity-mask `flags`. Any non-zero value is in-flight
     // injection / SMM / triple-fault state the restore would silently drop.
     let dropped_nonzero = e.exception_injected != 0
         || e.exception_has_error_code != 0
         || e.exception_has_payload != 0
         || e.exception_payload != 0
         || e.interrupt_injected != 0
-        || e.interrupt_nr != 0
+        && /* ~ changed by cargo-mutants ~ */ e.interrupt_nr != 0
         || e.interrupt_soft != 0
         || e.nmi_injected != 0
         || e.nmi_masked != 0
         || e.sipi_vector != 0
         || e.smi_smm != 0
         || e.smi_inside_nmi != 0
         || e.smi_latched_init != 0
         || e.triple_fault_pending != 0;


  stderr ───

    thread 'vmm::tests::save_vm_state_fails_closed_on_unrepresentable_events' (58559262) panicked at consonance/vmm-core/src/vmm.rs:4613:13:
    a non-zero interrupt_injected must fail the snapshot closed
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.019s] (165/224) vmm-core vmm::tests::save_vm_state_fails_closed_on_unrepresentable_events

*** result: Failure(100)
