*** consonance/vmm-core/src/snapshot.rs:536:9: replace || with && in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace || with && in unrepresentable_state
@@ -528,17 +528,17 @@
         || e.exception_has_error_code != 0
         || e.exception_has_payload != 0
         || e.exception_payload != 0
         || e.interrupt_injected != 0
         || e.interrupt_nr != 0
         || e.interrupt_soft != 0
         || e.nmi_injected != 0
         || e.nmi_masked != 0
-        || e.sipi_vector != 0
+        && /* ~ changed by cargo-mutants ~ */ e.sipi_vector != 0
         || e.smi_smm != 0
         || e.smi_inside_nmi != 0
         || e.smi_latched_init != 0
         || e.triple_fault_pending != 0;
     if dropped_nonzero {
         return Some(
             "pending-event state outside the captured subset is set (in-flight injection / SMM / \
              triple-fault) — snapshot only at a quiescent point (nothing armed)",


  stderr ───

    thread 'vmm::tests::save_vm_state_fails_closed_on_unrepresentable_events' (58549475) panicked at consonance/vmm-core/src/vmm.rs:4613:13:
    a non-zero nmi_masked must fail the snapshot closed
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.027s] (167/224) vmm-core vmm::tests::save_vm_state_fails_closed_on_unrepresentable_events

*** result: Failure(100)
