*** consonance/vmm-core/src/snapshot.rs:538:29: replace != with == in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace != with == in unrepresentable_state
@@ -530,17 +530,17 @@
         || e.exception_payload != 0
         || e.interrupt_injected != 0
         || e.interrupt_nr != 0
         || e.interrupt_soft != 0
         || e.nmi_injected != 0
         || e.nmi_masked != 0
         || e.sipi_vector != 0
         || e.smi_smm != 0
-        || e.smi_inside_nmi != 0
+        || e.smi_inside_nmi == /* ~ changed by cargo-mutants ~ */ 0
         || e.smi_latched_init != 0
         || e.triple_fault_pending != 0;
     if dropped_nonzero {
         return Some(
             "pending-event state outside the captured subset is set (in-flight injection / SMM / \
              triple-fault) — snapshot only at a quiescent point (nothing armed)",
         );
     }


  stderr ───
    [vmm-core] msr-exit dir=WRMSR exit-reason=KVM_EXIT_X86_WRMSR index=0x3b data=0x1234 rip=0x0 work=500 disposition=EmulateVtime

    thread 'vmm::tests::branch_restores_then_forks_the_entropy_stream' (58591964) panicked at consonance/vmm-core/src/vmm.rs:4332:35:
    called `Result::unwrap()` on an `Err` value: ContractViolation("save_vm_state: pending-event state outside the captured subset is set (in-flight injection / SMM / triple-fault) — snapshot only at a quiescent point (nothing armed)")
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.017s] (119/224) vmm-core vmm::tests::branch_restores_then_forks_the_entropy_stream

*** result: Failure(100)
