*** consonance/vmm-core/src/snapshot.rs:587:5: replace encode_device_blob -> DeviceBlob with Default::default()

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace encode_device_blob -> DeviceBlob with Default::default()
@@ -579,46 +579,17 @@
     put_u32(out, s.count_at_arm);
     put_u64(out, s.timer_arm_vns);
     out.push(u8::from(s.timer_running));
     out.push(u8::from(s.timer_pending));
 }
 
 /// Encode a [`DeviceState`] into the vmm-core device blob (the `DeviceBlob` bytes).
 pub(crate) fn encode_device_blob(d: &DeviceState) -> DeviceBlob {
-    let mut out = Vec::new();
-    put_u32(&mut out, DEVICE_BLOB_MAGIC);
-    put_u16(&mut out, DEVICE_BLOB_VERSION);
-    put_u64(&mut out, d.tsc_adjust);
-    put_u32(&mut out, d.report_stream.len() as u32);
-    for &word in &d.report_stream {
-        put_u32(&mut out, word);
-    }
-    put_u32(&mut out, d.uart.capture.len() as u32);
-    out.extend_from_slice(&d.uart.capture);
-    out.extend_from_slice(&d.uart.regs);
-    out.push(u8::from(d.uart.dlab));
-    out.push(d.uart.dlm);
-    match &d.lapic {
-        Some(l) => {
-            out.push(1);
-            put_lapic(&mut out, l);
-        }
-        None => out.push(0),
-    }
-    match &d.legacy {
-        Some(l) => {
-            out.push(1);
-            put_u32(&mut out, l.config_address);
-            out.push(l.master_imr);
-            out.push(l.slave_imr);
-        }
-        None => out.push(0),
-    }
-    DeviceBlob(out)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A total little-endian cursor over the device blob; every read is bounds-checked
 /// and yields `None` past end-of-buffer (mapped to [`SnapshotError::DeviceBlob`]).
 struct Reader<'a> {
     buf: &'a [u8],
     pos: usize,
 }


  stderr ───

    thread 'snapshot::tests::device_blob_decode_is_total_on_garbage' (58428446) panicked at consonance/vmm-core/src/snapshot.rs:969:9:
    assertion failed: matches!(decode_device_blob(&trailing),
        Err(SnapshotError::DeviceBlob("trailing bytes")))
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'snapshot::tests::device_blob_round_trips_all_fields' (58428463) panicked at consonance/vmm-core/src/snapshot.rs:920:51:
    called `Result::unwrap()` on an `Err` value: DeviceBlob("truncated header")
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'snapshot::tests::device_blob_lapic_restores_through_lapic_crate' (58428464) panicked at consonance/vmm-core/src/snapshot.rs:983:69:
    called `Result::unwrap()` on an `Err` value: DeviceBlob("truncated header")
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.025s] (100/221) vmm-core snapshot::tests::device_blob_decode_is_total_on_garbage
        FAIL [   0.029s] (103/221) vmm-core snapshot::tests::device_blob_round_trips_all_fields
        FAIL [   0.039s] (104/221) vmm-core snapshot::tests::device_blob_lapic_restores_through_lapic_crate
        FAIL [   0.031s] (106/221) vmm-core snapshot::tests::device_blob_round_trips_without_optional_devices

*** result: Failure(100)
