*** consonance/vmm-core/src/vmm.rs:1118:9: replace Vmm<B>::state_blob -> Vec<u8> with vec![0]

*** mutation diff:
--- consonance/vmm-core/src/vmm.rs
+++ replace Vmm<B>::state_blob -> Vec<u8> with vec![0]
@@ -1110,60 +1110,17 @@
     /// the effective V-time (`vns_base` + work folded into one canonical field), and the entropy
     /// stream position (seed + draws so far) — so two states with identical RAM/regs
     /// but different V-time/seed hash **differently** (the replay-equivalence
     /// `unison::compare_runs` relies on), while a restored VM and a fresh VM at the
     /// same effective V-time hash **identically** (see [`encode_vtime`]). Stock KVM /
     /// M1/M2 (`vtime: None`) emit **no** chunk, so their `state_hash` is byte-for-
     /// byte unchanged from before this was added.
     pub fn state_blob(&self) -> Vec<u8> {
-        let mut out = Vec::new();
-        put_chunk(&mut out, b"MEM\0", self.ram.as_bytes());
-        put_chunk(&mut out, b"VCPU", &encode_vcpu_state(&self.current_vcpu()));
-        put_chunk(&mut out, b"SERL", self.uart.capture());
-        put_chunk(&mut out, b"DEV\0", &self.encode_device_terminal());
-        if let Some(vt) = &self.vtime {
-            put_chunk(&mut out, b"VTIM", &encode_vtime(vt));
-        }
-        // The xAPIC chunk is present **only** on the Linux boot path (`lapic`
-        // wired); M1/M2/corpus emit none, so their hash is byte-for-byte
-        // unchanged. It captures the register file + timer bookkeeping that
-        // governs future interrupt delivery, so two same-seed Linux runs that
-        // leave the APIC in different state hash differently.
-        if let Some(lapic) = &self.lapic {
-            put_chunk(&mut out, b"LAPC", &encode_lapic_state(&lapic.snapshot()));
-        }
-        // Legacy-platform state (the PCI CONFIG_ADDRESS latch + the 8259 master/
-        // slave IMR) — Linux path only. The IMR governs which IRQ lines deliver, so
-        // two same-seed runs that leave it different (hence future interrupt
-        // delivery different) hash differently.
-        if let Some(legacy) = &self.legacy {
-            let mut legy = legacy.config_address().to_le_bytes().to_vec();
-            legy.extend_from_slice(&legacy.pic_imr());
-            put_chunk(&mut out, b"LEGY", &legy);
-        }
-        // The canonical `vm_state` blob, folded into the hash **only** when the
-        // snapshot/branch path opts in (`wire_snapshot_hashing`). Default-off keeps
-        // M1/M2/corpus/Linux-boot blobs byte-for-byte unchanged (their goldens do
-        // not move — task 39 "gate the swap"); when on, two states whose canonical
-        // blob differs hash differently, so a snapshot's integrity is in the hash.
-        // The only `encode` failure is `FractionalRatio`, which `build_vm_state`
-        // can never produce (`ratio_den` is the invariant `1`), so the fallback is
-        // unreachable; it is deterministic regardless.
-        if self.snapshot_hashing {
-            // Best-effort like the other hash chunks: `current_vcpu` uses the
-            // terminal-captured state or a swallowing live `save` (the snapshot path,
-            // `save_vm_state`, reads the vCPU fallibly instead).
-            let bytes = self
-                .build_vm_state(&self.current_vcpu())
-                .encode()
-                .unwrap_or_default();
-            put_chunk(&mut out, b"VMST", &bytes);
-        }
-        out
+        vec![0] /* ~ changed by cargo-mutants ~ */
     }
 
     /// `sha256(state_blob())` — the M2 determinism hash and the unison
     /// `state_hash`.
     pub fn state_hash(&self) -> [u8; 32] {
         let mut hasher = Sha256::new();
         hasher.update(self.state_blob());
         hasher.finalize().into()


  stderr ───

    thread 'bringup::tests::compose_linux_loads_kernel_and_wires_lapic' (58446588) panicked at consonance/vmm-core/src/bringup.rs:578:24:
    range start index 12 out of range for slice of length 1
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'bringup::tests::compose_drives_guestram_and_unsafe_map_memory' (58446590) panicked at consonance/vmm-core/src/bringup.rs:447:25:
    range end index 4 out of range for slice of length 1
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.025s] (  9/221) vmm-core bringup::tests::compose_linux_loads_kernel_and_wires_lapic
        FAIL [   0.030s] ( 10/221) vmm-core bringup::tests::compose_drives_guestram_and_unsafe_map_memory

*** result: Failure(100)
