*** consonance/vmm-core/src/snapshot.rs:510:16: replace != with == in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace != with == in unrepresentable_state
@@ -502,17 +502,17 @@
 ///   triple fault): zero at the quiescent point a snapshot is taken (INTEGRATION.md
 ///   §4: after an exit is fully serviced, nothing armed). The KVM validity-mask
 ///   `kvm_vcpu_events.flags` is **excluded** — it is ioctl metadata (normally
 ///   non-zero), not guest state the future depends on.
 ///
 /// Returns `None` for a clean quiescent snapshot. Pure.
 pub(crate) fn unrepresentable_state(vcpu: &vmm_backend::VcpuState) -> Option<&'static str> {
     let s = &vcpu.sregs;
-    if s.flags != 0 {
+    if s.flags == /* ~ changed by cargo-mutants ~ */ 0 {
         return Some(
             "kvm_sregs2 flags is set (e.g. PDPTRS_VALID) — the vm_state subset does not carry it; \
              the determinism guest is 64-bit / paging-off, so a snapshot here is unrepresentable",
         );
     }
     if s.pdptrs.iter().any(|&p| p != 0) {
         return Some(
             "PAE PDPTRs are non-zero — not carried by the vm_state subset (the determinism guest \


  stderr ───
    [vmm-core] msr-exit dir=WRMSR exit-reason=KVM_EXIT_X86_WRMSR index=0x3b data=0x1234 rip=0x0 work=500 disposition=EmulateVtime

    thread 'vmm::tests::branch_restores_then_forks_the_entropy_stream' (58625254) panicked at consonance/vmm-core/src/vmm.rs:4332:35:
    called `Result::unwrap()` on an `Err` value: ContractViolation("save_vm_state: kvm_sregs2 flags is set (e.g. PDPTRS_VALID) — the vm_state subset does not carry it; the determinism guest is 64-bit / paging-off, so a snapshot here is unrepresentable")
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.021s] (118/224) vmm-core vmm::tests::branch_restores_then_forks_the_entropy_stream

*** result: Failure(100)
