*** consonance/vmm-core/src/snapshot.rs:516:35: replace != with == in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace != with == in unrepresentable_state
@@ -508,17 +508,17 @@
 pub(crate) fn unrepresentable_state(vcpu: &vmm_backend::VcpuState) -> Option<&'static str> {
     let s = &vcpu.sregs;
     if s.flags != 0 {
         return Some(
             "kvm_sregs2 flags is set (e.g. PDPTRS_VALID) — the vm_state subset does not carry it; \
              the determinism guest is 64-bit / paging-off, so a snapshot here is unrepresentable",
         );
     }
-    if s.pdptrs.iter().any(|&p| p != 0) {
+    if s.pdptrs.iter().any(|&p| p == /* ~ changed by cargo-mutants ~ */ 0) {
         return Some(
             "PAE PDPTRs are non-zero — not carried by the vm_state subset (the determinism guest \
              is 64-bit / paging-off, where PDPTRs are unused)",
         );
     }
     let e = &vcpu.events;
     // Every `VcpuEvents` field NOT in the captured subset {exception_pending,
     // exception_nr, exception_error_code, nmi_pending, smi_pending, interrupt_shadow}


  stderr ───
    [vmm-core] msr-exit dir=WRMSR exit-reason=KVM_EXIT_X86_WRMSR index=0x3b data=0x1234 rip=0x0 work=500 disposition=EmulateVtime

    thread 'vmm::tests::branch_restores_then_forks_the_entropy_stream' (58614407) panicked at consonance/vmm-core/src/vmm.rs:4332:35:
    called `Result::unwrap()` on an `Err` value: ContractViolation("save_vm_state: PAE PDPTRs are non-zero — not carried by the vm_state subset (the determinism guest is 64-bit / paging-off, where PDPTRs are unused)")
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.028s] (122/224) vmm-core vmm::tests::branch_restores_then_forks_the_entropy_stream

*** result: Failure(100)
