*** consonance/vmm-core/src/snapshot.rs:533:9: replace || with && in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace || with && in unrepresentable_state
@@ -525,17 +525,17 @@
     // — EXCLUDING the validity-mask `flags`. Any non-zero value is in-flight
     // injection / SMM / triple-fault state the restore would silently drop.
     let dropped_nonzero = e.exception_injected != 0
         || e.exception_has_error_code != 0
         || e.exception_has_payload != 0
         || e.exception_payload != 0
         || e.interrupt_injected != 0
         || e.interrupt_nr != 0
-        || e.interrupt_soft != 0
+        && /* ~ changed by cargo-mutants ~ */ e.interrupt_soft != 0
         || e.nmi_injected != 0
         || e.nmi_masked != 0
         || e.sipi_vector != 0
         || e.smi_smm != 0
         || e.smi_inside_nmi != 0
         || e.smi_latched_init != 0
         || e.triple_fault_pending != 0;
     if dropped_nonzero {

*** result: Success
