*** consonance/vmm-core/src/snapshot.rs:544:34: replace != with == in unrepresentable_state

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace != with == in unrepresentable_state
@@ -536,17 +536,17 @@
         u64::from(e.nmi_injected),
         u64::from(e.nmi_masked),
         u64::from(e.sipi_vector),
         u64::from(e.smi_smm),
         u64::from(e.smi_inside_nmi),
         u64::from(e.smi_latched_init),
         u64::from(e.triple_fault_pending),
     ];
-    if dropped.iter().any(|&x| x != 0) {
+    if dropped.iter().any(|&x| x == /* ~ changed by cargo-mutants ~ */ 0) {
         return Some(
             "pending-event state outside the captured subset is set (in-flight injection / SMM / \
              triple-fault) — snapshot only at a quiescent point (nothing armed)",
         );
     }
     None
 }


  stderr ───
    [vmm-core] msr-exit dir=WRMSR exit-reason=KVM_EXIT_X86_WRMSR index=0x3b data=0x1234 rip=0x0 work=500 disposition=EmulateVtime

    thread 'vmm::tests::branch_restores_then_forks_the_entropy_stream' (58619590) panicked at consonance/vmm-core/src/vmm.rs:4332:35:
    called `Result::unwrap()` on an `Err` value: ContractViolation("save_vm_state: pending-event state outside the captured subset is set (in-flight injection / SMM / triple-fault) — snapshot only at a quiescent point (nothing armed)")
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.027s] (122/224) vmm-core vmm::tests::branch_restores_then_forks_the_entropy_stream

*** result: Failure(100)
