*** consonance/vmm-core/src/snapshot.rs:703:5: replace decode_device_blob -> Result<DeviceState, SnapshotError> with Ok(Default::default())

*** mutation diff:
--- consonance/vmm-core/src/snapshot.rs
+++ replace decode_device_blob -> Result<DeviceState, SnapshotError> with Ok(Default::default())
@@ -695,68 +695,17 @@
             timer_pending: self.bool()?,
         })
     }
 }
 
 /// Decode the vmm-core device blob. Strict and total: any malformation is a
 /// [`SnapshotError::DeviceBlob`], never a panic.
 pub(crate) fn decode_device_blob(blob: &[u8]) -> Result<DeviceState, SnapshotError> {
-    let mut r = Reader::new(blob);
-    let bad = |m: &'static str| SnapshotError::DeviceBlob(m);
-    if r.u32().ok_or(bad("truncated header"))? != DEVICE_BLOB_MAGIC {
-        return Err(bad("bad magic"));
-    }
-    if r.u16().ok_or(bad("truncated version"))? != DEVICE_BLOB_VERSION {
-        return Err(bad("unsupported version"));
-    }
-    let tsc_adjust = r.u64().ok_or(bad("truncated tsc_adjust"))?;
-    let report_len = r.u32().ok_or(bad("truncated report len"))? as usize;
-    let mut report_stream = Vec::with_capacity(report_len.min(1 << 16));
-    for _ in 0..report_len {
-        report_stream.push(r.u32().ok_or(bad("truncated report stream"))?);
-    }
-    let cap_len = r.u32().ok_or(bad("truncated capture len"))? as usize;
-    let capture = r.take(cap_len).ok_or(bad("truncated capture"))?.to_vec();
-    let regs: [u8; 8] = r
-        .take(8)
-        .ok_or(bad("truncated uart regs"))?
-        .try_into()
-        .map_err(|_| bad("uart regs len"))?;
-    let dlab = r.bool().ok_or(bad("bad uart dlab"))?;
-    let dlm = r.u8().ok_or(bad("truncated uart dlm"))?;
-    let lapic = match r.u8().ok_or(bad("truncated lapic flag"))? {
-        0 => None,
-        1 => Some(r.lapic().ok_or(bad("truncated lapic"))?),
-        _ => return Err(bad("bad lapic flag")),
-    };
-    let legacy = match r.u8().ok_or(bad("truncated legacy flag"))? {
-        0 => None,
-        1 => Some(LegacyState {
-            config_address: r.u32().ok_or(bad("truncated legacy addr"))?,
-            master_imr: r.u8().ok_or(bad("truncated master imr"))?,
-            slave_imr: r.u8().ok_or(bad("truncated slave imr"))?,
-        }),
-        _ => return Err(bad("bad legacy flag")),
-    };
-    if r.pos != blob.len() {
-        return Err(bad("trailing bytes"));
-    }
-    Ok(DeviceState {
-        tsc_adjust,
-        report_stream,
-        uart: UartState {
-            capture,
-            regs,
-            dlab,
-            dlm,
-        },
-        lapic,
-        legacy,
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn lapic_state(tpr: u32) -> LapicState {
         LapicState {


  stderr ───

    thread 'snapshot::tests::device_blob_round_trips_all_fields' (58446426) panicked at consonance/vmm-core/src/snapshot.rs:899:9:
    assertion `left == right` failed
      left: DeviceState { tsc_adjust: 0, report_stream: [], uart: UartState { capture: [], regs: [0, 0, 0, 0, 0, 0, 0, 0], dlab: false, dlm: 0 }, lapic: None, legacy: None }
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'snapshot::tests::device_blob_lapic_restores_through_lapic_crate' (58446427) panicked at consonance/vmm-core/src/snapshot.rs:962:32:
    lapic present
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace


  stderr ───

    thread 'snapshot::tests::device_blob_decode_is_total_on_garbage' (58446431) panicked at consonance/vmm-core/src/snapshot.rs:927:9:
    assertion failed: matches!(decode_device_blob(&[]), Err(SnapshotError::DeviceBlob(_)))
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.022s] (104/221) vmm-core snapshot::tests::device_blob_round_trips_all_fields
        FAIL [   0.023s] (105/221) vmm-core snapshot::tests::device_blob_lapic_restores_through_lapic_crate
        FAIL [   0.023s] (106/221) vmm-core snapshot::tests::device_blob_decode_is_total_on_garbage
        FAIL [   0.021s] (107/221) vmm-core snapshot::tests::device_blob_round_trips_without_optional_devices

*** result: Failure(100)
