*** consonance/vmm-core/src/vmm.rs:775:9: replace Vmm<B>::save_vm_state -> Result<vm_state::VmState, VmmError> with Ok(Default::default())

*** mutation diff:
--- consonance/vmm-core/src/vmm.rs
+++ replace Vmm<B>::save_vm_state -> Result<vm_state::VmState, VmmError> with Ok(Default::default())
@@ -767,40 +767,17 @@
     /// restored VM's first service — so there is no separate injection plan to
     /// serialize (vm-state deliberately has no plan field).
     ///
     /// # Errors
     /// [`VmmError::ContractViolation`] at an RNG mid-exit boundary or a
     /// non-synchronized point; [`VmmError::Backend`] if reading the live vCPU state
     /// fails (a snapshot **fails closed** rather than sealing a zeroed vCPU).
     pub fn save_vm_state(&self) -> Result<vm_state::VmState, VmmError> {
-        if self.rng_completion_staged {
-            return Err(VmmError::ContractViolation(
-                "save_vm_state at an RNG mid-exit boundary: the seeded RDRAND/RDSEED draw advanced \
-                 the stream but its completion is staged, not committed — snapshot only at a clean \
-                 boundary (step once more first)."
-                    .to_string(),
-            ));
-        }
-        if self.vtime.is_some() && !self.vtime_synchronized {
-            return Err(VmmError::ContractViolation(
-                "save_vm_state at a non-synchronized point: the exact V-time (which a restored TSC \
-                 resumes from) is known only at a V-time intercept (RDTSC/RDTSCP/RDRAND/RDSEED or a \
-                 TSC MSR). Snapshot at a V-time-intercept boundary."
-                    .to_string(),
-            ));
-        }
-        // Read the vCPU **fallibly**: a `Backend::save` failure must abort the
-        // snapshot, not seal a `VcpuState::default()` (the swallowing `current_vcpu`
-        // does for the best-effort hash). Use the terminal-captured state if present.
-        let vcpu = match &self.saved_state {
-            Some(s) => s.clone(),
-            None => self.backend.save()?,
-        };
-        Ok(self.build_vm_state(&vcpu))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Restore the **non-memory** machine state from a [`vm_state::VmState`] (pair
     /// with [`Vmm::restore_guest_memory`]; or use [`Vmm::restore_snapshot`] for
     /// both). Decodes the typed records back into the vCPU via `Backend::restore`,
     /// resumes the V-time clock (`vns_base` = the snapshot's V-time, the hardware
     /// counter reset to 0) + entropy stream + `IA32_TSC_ADJUST`, and restores the
     /// xAPIC + legacy platform + UART from the device blob.


  stderr ───
    [vmm-core] msr-exit dir=WRMSR exit-reason=KVM_EXIT_X86_WRMSR index=0x3b data=0x1234 rip=0x0 work=500 disposition=EmulateVtime

    thread 'vmm::tests::branch_restores_then_forks_the_entropy_stream' (58442422) panicked at consonance/vmm-core/src/vmm.rs:4293:32:
    called `Result::unwrap()` on an `Err` value: Snapshot(ContractMismatch)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.027s] (126/221) vmm-core vmm::tests::branch_restores_then_forks_the_entropy_stream

*** result: Failure(100)
