*** consonance/vmm-core/src/vmm.rs:778:9: replace Vmm<B>::save_vm_state -> Result<vm_state::VmState, VmmError> with Ok(Default::default())

*** mutation diff:
--- consonance/vmm-core/src/vmm.rs
+++ replace Vmm<B>::save_vm_state -> Result<vm_state::VmState, VmmError> with Ok(Default::default())
@@ -770,50 +770,17 @@
     /// # Errors
     /// [`VmmError::ContractViolation`] at an RNG mid-exit boundary, a non-synchronized
     /// point, or if the live vCPU carries state the representable `vm_state` subset
     /// cannot round-trip (`kvm_sregs2` flags/pdptrs, or in-flight injection / SMM /
     /// triple-fault event bookkeeping — see [`crate::snapshot::unrepresentable_state`]);
     /// [`VmmError::Backend`] if reading the live vCPU state fails (a snapshot **fails
     /// closed** rather than sealing a zeroed or lossy vCPU).
     pub fn save_vm_state(&self) -> Result<vm_state::VmState, VmmError> {
-        if self.rng_completion_staged {
-            return Err(VmmError::ContractViolation(
-                "save_vm_state at an RNG mid-exit boundary: the seeded RDRAND/RDSEED draw advanced \
-                 the stream but its completion is staged, not committed — snapshot only at a clean \
-                 boundary (step once more first)."
-                    .to_string(),
-            ));
-        }
-        if self.vtime.is_some() && !self.vtime_synchronized {
-            return Err(VmmError::ContractViolation(
-                "save_vm_state at a non-synchronized point: the exact V-time (which a restored TSC \
-                 resumes from) is known only at a V-time intercept (RDTSC/RDTSCP/RDRAND/RDSEED or a \
-                 TSC MSR). Snapshot at a V-time-intercept boundary."
-                    .to_string(),
-            ));
-        }
-        // Read the vCPU **fallibly**: a `Backend::save` failure must abort the
-        // snapshot, not seal a `VcpuState::default()` (the swallowing `current_vcpu`
-        // does for the best-effort hash). Use the terminal-captured state if present.
-        let vcpu = match &self.saved_state {
-            Some(s) => s.clone(),
-            None => self.backend.save()?,
-        };
-        // Fail closed on machine state the representable `vm_state` subset would
-        // silently zero on restore (`kvm_sregs2` flags/pdptrs, or pending-event
-        // injection/SMM/triple-fault bookkeeping) — sealing a lossy blob is worse
-        // than refusing it. Zero at a real quiescent snapshot point (64-bit guest, no
-        // armed injection); a non-zero value is a misuse / a non-quiescent snapshot.
-        if let Some(reason) = snapshot::unrepresentable_state(&vcpu) {
-            return Err(VmmError::ContractViolation(format!(
-                "save_vm_state: {reason}"
-            )));
-        }
-        Ok(self.build_vm_state(&vcpu))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Restore the **non-memory** machine state from a [`vm_state::VmState`] (pair
     /// with [`Vmm::restore_guest_memory`]; or use [`Vmm::restore_snapshot`] for
     /// both). Decodes the typed records back into the vCPU via `Backend::restore`,
     /// resumes the V-time clock (`vns_base` = the snapshot's V-time, the hardware
     /// counter reset to 0) + entropy stream + `IA32_TSC_ADJUST`, and restores the
     /// xAPIC + legacy platform + UART from the device blob.


  stderr ───
    [vmm-core] msr-exit dir=WRMSR exit-reason=KVM_EXIT_X86_WRMSR index=0x3b data=0x1234 rip=0x0 work=500 disposition=EmulateVtime

    thread 'vmm::tests::branch_restores_then_forks_the_entropy_stream' (58595056) panicked at consonance/vmm-core/src/vmm.rs:4307:32:
    called `Result::unwrap()` on an `Err` value: Snapshot(ContractMismatch)
    note: run with `RUST_BACKTRACE=1` environment variable to display a backtrace

        FAIL [   0.024s] (127/224) vmm-core vmm::tests::branch_restores_then_forks_the_entropy_stream

*** result: Failure(100)
